<!DOCTYPE html>

<!-- Ejercicios de autoevaluación -->
<!-- 5.16 Consulta de medios -->
<html>
    <head>
        <meta charset="UTF-8">
        <title>Ejercicios de autoevaluaci&oacute;n: 5.16</title>
        <style type="text/css">
            @media handheld and (max-width: 480px), 
            screen and (max-device-width: 480px), 
            screen and (max-width: 480px){
                .multicolumna{
                    -webkit-column-count: 1;
                    column-count: 1;
                }
            }
            .flotante{
                background-color: lightgrey;
                font-size: 1.5em;
                font-family: Arial, Helvetica, sans-serif;
                padding: .2em;
                margin-left: .5em;
                margin-bottom: .5em;
                float: right;
                text-align: right;
                width: 50%;
            }
            .multicolumna{
                /* establecer el número de columnas en 3 */
                -webkit-column-count: 2;
                -moz-column-count: 2;
                -o-column-count: 2;
                column-count: 2;
                /* establecer el espacio entre columnas en 30px */
                -webkit-column-gap: 30px;
                -moz-column-gap: 30px;
                -o-column-gap: 30px;
                column-gap: 30px;
                /* agregar una línea negra de 1px entre cada columna */
                -webkit-column-rule: 3px outset black;
                -moz-column-rule: 3px outset black;
                -o-column-rule: 3px outset black;
                column-rule: 3px outset black;
            }
        </style>
    </head>
    <body>
        <h2>5.16 Consulta de medios</h2>
        <p>Cree su propia p&aacute;gina Web multicolumna y use consultas de medios para ajustar el formato y 
            usar una columna para dispositivos m&oacute;viles que tengan una anchura m&aacute;xima de 480px.
        </p>
        <hr>
        <header>
            <h1>Computadoras, hardware y software</h1>
        </header>
        <div class="multicolumna">
            <h3>¿Qu&eacute; es una computadora?</h3>
            <img class="flotante" src="computadora.jpg" alt="computadora">
            <p>Una computadora es un dispositivo que puede realizar c&aacute;lculos y tomar decisiones 
                l&oacute;gicas con mucha m&aacute;s rapidez que los humanos. Muchas de las computadoras 
                personales de la actualidad pueden realizar miles de millones de c&aacute;lculos en un 
                segundo&mdash;m&aacute;s de lo que un humano puede realizar durante toda su vida. Las 
                supercomputadoras ya se encuentran realizando miles de billones (trillones) de instrucciones 
                por segundo. Para poner esto en perspectiva, una computadora de un trill&oacute;n de 
                instrucciones por segundo puede realizar en un segundo m&aacute;s de 100,000 c&aacute;lculos 
                para cada persona en el planeta. Y&mdash;estos "l&iacute;mites superiores" aumentan con rapidez.
            </p>
            <h3>Software</h3>
            <p>Las computadoras procesan datos bajo el control de conjuntos de instrucciones llamadas programas 
                de computadora. Estos programas gu&iacute;an a la computadora por conjuntos ordenados de 
                acciones especificadas por personas llamadas programadores de computadora. Los programas que se 
                ejecutan en una computadora se conoce como software. En este libro usted aprender&aacute; sobre 
                la metodolog&iacute;a de programaci&oacute;n clave de la actualidad que mejora la productividad 
                del programador, con lo cual se reducen los costos de desarrollo de software&mdash;programaci&oacute;n 
                orientada a objetos.
            </p>
            <h3>Hardware</h3>
            <p>Una computadora consiste de diversos dispositivos conocidos como hardware (por ejemplo: el 
                teclado, pantalla, rat&oacute;n, discos duros, memoria, DVD y unidades de procesamiento). Los 
                costos de las computadoras disminuyen en forma dram&aacute;tica, debido a los r&aacute;pidos 
                desarrollos en las tecnolog&iacute;as de hardware y software. Las computadoras podr&iacute;an 
                haber llenado salones extensos y costar millones de d&oacute;lares hace unas d&eacute;cadas 
                ahora se inscriben chips de silicio m&aacute;s chicos que una u&ntilde;a, que cuestan tal vez 
                unos cuantos d&oacute;lares. Por iron&iacute;a, el silicio es uno de los materiales m&aacute;s 
                abundantes&mdash;es un ingrediente en la arena ordinaria. La tecnolog&iacute;a de chips de 
                silicio ha hecho la computaci&oacute;n tan econ&oacute;mica que hay m&aacute;s de mil millones 
                de computadoras de prop&oacute;sito general en uso en todo el mundo, y se espera que esta 
                cifra se duplique en los pr&oacute;ximos a&ntilde;os.
            </p>
            <p>Los chips de computadora (microprocesadores) controlan innumerables dispositivos. Estos sistemas 
                incrustados incluyen frenos antibloqueo en los autos, sistema de navegaci&oacute;n, 
                electrodom&eacute;sticos inteligentes, sistemas de seguridad en el hogar, tel&eacute;fonos 
                celulares y Smartphones, robots, intersecciones de tr&aacute;fico inteligentes, sistemas para 
                evitar colisiones, controladores de videojuegos y m&aacute;s. La inmensa mayor&iacute;a de los 
                microprocesadores que se producen ca a&ntilde;o se incrustan en dispositivos que no son 
                computadoras de prop&oacute;sito general.
            </p>
            <p><em>Autor: Deitel & Associates, Inc.</em></p>
            <footer>
                <em>&copy; 2012 por Pearson Education, Inc. Todos los derechos reservados.</em>
            </footer>
        </div>
    </body>
</html>