<!DOCTYPE html>

<!-- Ejercicios de autoevaluación -->
<!-- 3.11 Agregar un elemento details -->
<html>
    <head>
        <meta charset="UTF-8">
        <title>Ejercicios de autoevaluaci&oacute;n: 3.11</title>
    </head>
    <body>
        <form action="../../menu.html">
            <input type="submit" class="button" value="Regresar">
        </form>
        <h2>3.11 (Disposici&oacute;n de las p&aacute;ginas de nuestro libro en HTML5: agregar un elemento 
            details).
        </h2>
        <hr>
        <p>Modifique su soluci&oacute;n al ejercicio 3.10 para agregar la tabla en la figura 3.5. Use la 
            leyenda de la figura como el elemento summary y aplique formato a la tabla como un elemento 
            table de HTML5 dentro del elemento details.
        </p>
        <p><strong>Resultado: </strong></p>
        <section id="1">
            <h2>3.2.2 input tipo color</h2>
            <p>El <strong>tipo input color</strong> (figura 3.1, l&iacute;nea 20 y 21) permite al usuario 
                introducir un color. Al momento de escribir este libro, algunos navegadores despliegan el tipo 
                input color como un campo de texto en donde el usuario puede introducir un c&oacute;digo 
                hexadecimal o el nombre de un color. Hay dos navegadores, Chrome y Opera, que muestran un 
                <em>selector de color</em> similar al cuadro de di&aacute;logo de colores de Microsoft "indows, 
                que se muestra en la figura 3.2. En el futuro, cuando haga clic en un elemento input color, es 
                muy probable que el resto de los navegadores muestren un <em>selector de color</em> tambi&eacute;n.
            </p>
            
            <figure style="text-align: center;">
                <hr>
                <img src="figura-3_2.png" alt="selector de color" >
                <hr>
                <figcaption><strong>Figura 3.2</strong> | Un di&aacute;logo para seleccionar colores.</figcaption>
            </figure>
        </section>
        <section id="2">
            <h4><em>El atributo autofocus</em></h4>
            <p>El <strong>atributo focus</strong> (figura 3.1, linea 20) (un atributo opcional que puede usarse 
                s&oacute;lo en un elemento input del formulario) otorga de maneta autom&aacute;tica el enfoque 
                al elemento input, lo que permite al usuario escribir en ese elemento de inmediato. La figura 
                3.3 muestra el uso del elemento <em>autofocus</em> en el elemento <em>color</em> (el primer 
                elemento input en nuestro formulario), como se despliega en Opera. No necesita incluir autofocus 
                en sus formularios.
            </p>

            <figure style="text-align: center;">
                <hr>
                <img src="figura-3_3.png" alt="atributo autofocus" >
                <hr>
                <figcaption><strong>Figura 3.3</strong> | Autofocus en el elemento input <em>color</em> cuando se usa el navegador Opera.</figcaption>
            </figure>
        </section>
        <section id="3">
            <h4><em>Validaci&oacute;n</em></h4>
            <p>Tradicionalmente ha sido dif&iacute;cil validar la entrada del usuario, como asegurar que se 
                introduzca una direcci&oacute;n de correo electr&oacute;nico, URL, fecha u hora en el formato 
                adecuado. Los nuevos tipos <em>input</em> de HTML5 cuentan con <em>validaci&oacute;n 
                autom&aacute;tica</em> del lado del cliente, con lo que se elimina la necesidad de agregar 
                c&oacute;digo complicado de JavaScript a nuestras p&aacute;ginas Web para validar la entrada del 
                usuario; as&iacute; se reduce la cantidad de datos inv&aacute;lidos que se env&iacute;n y, en 
                consecuencia, disminuye el tr&aacute;fico de Internet entre el servidor y el cliente que se usa 
                para corregir las entradas inv&aacute;lidas. <em>De todas formas el servidor debe validar toda 
                la entrada del usuario</em>.
            </p>
            <p style="text-indent: 1.5em;">Cuando un usuario introduce datos en un formulario y luego lo 
                env&iacute;a (en este ejemplo, al hacer clic en el bot&oacute;n <strong>Enviar</strong>), el 
                navegador verifica de inmediato los elementos de validaci&oacute;n autom&aacute;tica para 
                asegurar que los datos sean correctos. Por ejemplo, si un usuario introduce un valor de color 
                hexadecimal incorrecto al usar un navegador que despliegue los elementos <em>color</em> como un 
                campo de texto (por ejemplo, Internet Explorer), aparecer&aacute; una anotaci&oacute;n para 
                señalar ese elemento e indicar que se introdujo un valor incorrecto (figura 3.4). La figura 3.5 
                lista cada uno de los nuevos tipos <em>input</em> de HTML5 y muestra ejemplos de los formatos 
                correctos requeridos para que cada tipo de datos sea v&aacute;lido.
            </p>

            <figure style="text-align: center;">
                <hr>
                <img src="figura-3_4.png" alt="validación input" >
                <hr>
                <figcaption><strong>Figura 3.4</strong> | Validaci&oacute;n de un elemento input color. (Actualmente ya no existe esta funcionalidad en Chrome).</figcaption>
            </figure>

            <details>
                <summary>Tipos de input con validaci&oacute;n autom&aacute;tica.</summary>
                <ul>
                    <table border="1" >
                        <thead>
                            <tr>
                                <th>tipo de input</th>
                                <th>Formato</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>color</td>
                                <td>C&oacute;digo hexadecimal</td>
                            </tr>
                            <tr>
                                <td>Date</td>
                                <td>aaaa-mm-dd</td>
                            </tr>
                            <tr>
                                <td>Datetime</td>
                                <td>aaaa-mm-dd</td>
                            </tr>
                            <tr>
                                <td>datetime-local</td>
                                <td>aaaa-mm-ddThh:mm</td>
                            </tr>
                            <tr>
                                <td>Month</td>
                                <td>aaaa-mm</td>
                            </tr>
                            <tr>
                                <td>Number</td>
                                <td>Cualquier valor num&eacute;rico</td>
                            </tr>
                            <tr>
                                <td>email</td>
                                <td>nombre@dominio.com</td>
                            </tr>
                            <tr>
                                <td>url</td>
                                <td>http://www.nombredominio.com</td>
                            </tr>
                            <tr>
                                <td>time</td>
                                <td>hh:mm</td>
                            </tr>
                            <tr>
                                <td>week</td>
                                <td>aaaa-Wnn</td>
                            </tr>
                        </tbody>
                    </table>
                </ul>
            </details>
        </section>
        <section id="4">
            <p style="text-indent: 1.5em;">Si desea pasar por alto la validaci&oacute;, puede agregar el 
                <strong>atributo formnovalidate</strong> al tipo input <em>submit</em> en la l&iacute;nea 101:
            </p>
            <p style="text-align: center;"><mark>&lt;input type = "submit" value = "Enviar" formnovalidate/&gt;</mark></p>
        </section>
    </body>
</html>